docs/posts/notes-optics.html
<?xml version="1.0" encoding="utf-8"?>
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-04-25 Sat 12:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Notes on optics</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mario Román" />
<link rel="stylesheet" href="../css/default.css" />
<link rel="stylesheet" href="../css/mathjax_fonts.css" />
<link rel="stylesheet" href="../css/syntax.css" />
<div id="header">
<div id="logo">
<a hrwef="../index.html">Mario Román</a>
</div>
<div id="navigation">
<a href="../index.html">About</a>
<a href="../posts/index.html">Blog</a>
<a href="https://github.com/mroman42/">Github</a>
</div>
</div>
</head>
<body>
<div id="content">
<h1 class="title">Notes on optics</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb54c06a">Lawful mixed optics</a></li>
<li><a href="#orgf3cc61d">Autonomous lenses</a></li>
<li><a href="#orgbead320">Kaleidoscopes, monoidal lenses, comonoidal prisms</a></li>
<li><a href="#orge936ba8">The &ldquo;Glass&rdquo; optic&#xa0;&#xa0;&#xa0;<span class="tag"><span class="post">post</span></span></a></li>
</ul>
</div>
</div>

<div id="outline-container-orgb54c06a" class="outline-2">
<h2 id="orgb54c06a">Lawful mixed optics</h2>
<div class="outline-text-2" id="text-orgb54c06a">
<p>
A first notion of what a lawful mixed optic should be is to push both
parts of the optic into the same category and consider lawfulness
there.
</p>

<p>
In the case of monadic lenses for copointed monads, this can give a
reasonable notion of laws.
</p>
</div>
</div>

<div id="outline-container-orgf3cc61d" class="outline-2">
<h2 id="orgf3cc61d">Autonomous lenses</h2>
<div class="outline-text-2" id="text-orgf3cc61d">
<p>
An interesting consideration is to see what happens if we extend the Optic
formula on the product to a more symmetric case.
\[
\int^{C,D} \mathbf{C}(D \times S, C \times A) \times \mathbf{C}(C \times B, D \times T)
\]
In the same way that lenses give teleological categories, this should give
a category with formal cups and caps. I am interested on this because that
means it would be a way of constructing models of DisCoCat following this
idea by <a href="https://arxiv.org/abs/1411.3827">Delpeuch</a>.
</p>

<p>
I have now realized that this is in fact the category of learners as described
by Fong and Johnson.  Can we use learners in DisCoCat?
</p>
</div>
</div>

<div id="outline-container-orgbead320" class="outline-2">
<h2 id="orgbead320">Kaleidoscopes, monoidal lenses, comonoidal prisms</h2>
<div class="outline-text-2" id="text-orgbead320">
<p>
A <b>kaleidoscope</b> is the optic for applicative functors. Using the free
applicative construction (from Capriotti-Kaposi, for instance), we can
show their concrete representation is the following.
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #81A1C1;">type</span> <span style="color: #8FBCBB;">Kaleidoscope</span> s t a b <span style="color: #d9c6d6;">=</span> <span style="color: #81A1C1;">forall</span> n <span style="color: #d9c6d6;">.</span> (<span style="color: #8FBCBB;">Vec</span> n a <span style="color: #d9c6d6;">-&gt;</span> b) <span style="color: #d9c6d6;">-&gt;</span> (<span style="color: #8FBCBB;">Vec</span> n s <span style="color: #d9c6d6;">-&gt;</span> t)
</pre>
</div>

<p>
If we take lenses where complements are monad algebras or prisms where
the complements are comonad coalgebras, we get <b>monadic lenses</b> and
<b>comonadic prisms</b>, that we can write as
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #81A1C1;">type</span> <span style="color: #8FBCBB;">MonLens</span> m s t a b <span style="color: #d9c6d6;">=</span> (s <span style="color: #d9c6d6;">-&gt;</span> a , m s <span style="color: #d9c6d6;">-&gt;</span> b <span style="color: #d9c6d6;">-&gt;</span> t)
<span style="color: #81A1C1;">type</span> <span style="color: #8FBCBB;">ComonPrism</span> n s t a b <span style="color: #d9c6d6;">=</span> (s <span style="color: #d9c6d6;">-&gt;</span> n t <span style="color: #d9c6d6;">+</span> a , b <span style="color: #d9c6d6;">-&gt;</span> t)
</pre>
</div>

<p>
I am not sure if these optics are elsewhere in the literature, but I have not
been able to find them so far.
</p>
</div>
</div>

<div id="outline-container-orge936ba8" class="outline-2">
<h2 id="orge936ba8">The &ldquo;Glass&rdquo; optic&#xa0;&#xa0;&#xa0;<span class="tag"><span class="post">post</span></span></h2>
<div class="outline-text-2" id="text-orge936ba8">
<p>
At the intersection between a <b>lens</b> and a <b>grate</b> there should be an
optic that I have started to call <b>glass</b>.  If the pseudomonoid action
that describes a lens is  (c × _)  and the one for glass is  (c -&gt; _),
the action that we want to get should be the one given by the
coproduct pseudomonoid.
</p>

<p>
We rewrite the action of every word <code>c₁d₁ ... cₖdₖ</code> on some object
<code>a</code> as follows, for some  e,f ∈ <b>C</b>, a bicartesian closed category.
</p>

<div class="org-src-container">
<pre class="src src-haskell">  d&#8321; <span style="color: #d9c6d6;">&#215;</span> (c&#8321; <span style="color: #d9c6d6;">-&gt;</span> d&#8322; <span style="color: #d9c6d6;">&#215;</span> (c&#8322; <span style="color: #d9c6d6;">-&gt;</span> <span style="color: #d9c6d6;">...</span> x))  <span style="color: #d9c6d6;">&#8773;</span>
  d&#8321; <span style="color: #d9c6d6;">&#215;</span> (c&#8321; <span style="color: #d9c6d6;">-&gt;</span> d&#8322;) <span style="color: #d9c6d6;">&#215;</span> (c&#8321; <span style="color: #d9c6d6;">&#215;</span> c&#8322; <span style="color: #d9c6d6;">-&gt;</span> <span style="color: #d9c6d6;">...</span> x)  <span style="color: #d9c6d6;">&#8773;</span>
  e <span style="color: #d9c6d6;">&#215;</span> (f <span style="color: #d9c6d6;">-&gt;</span> x)
</pre>
</div>

<p>
And we derive the concrete representation.
</p>

<div class="org-src-container">
<pre class="src src-haskell">  <span style="color: #d9c6d6;">&#8707;</span> c,d <span style="color: #d9c6d6;">.</span>  (s <span style="color: #d9c6d6;">-&gt;</span> (c <span style="color: #d9c6d6;">&#215;</span> (d <span style="color: #d9c6d6;">-&gt;</span> a))) <span style="color: #d9c6d6;">&#215;</span> (c <span style="color: #d9c6d6;">&#215;</span> (d <span style="color: #d9c6d6;">-&gt;</span> b) <span style="color: #d9c6d6;">-&gt;</span> t)  <span style="color: #d9c6d6;">&#8773;</span>
  <span style="color: #d9c6d6;">&#8707;</span> c,d <span style="color: #d9c6d6;">.</span>  (s <span style="color: #d9c6d6;">-&gt;</span> c) <span style="color: #d9c6d6;">&#215;</span> (s <span style="color: #d9c6d6;">-&gt;</span> (d <span style="color: #d9c6d6;">-&gt;</span> a)) <span style="color: #d9c6d6;">&#215;</span> (c <span style="color: #d9c6d6;">&#215;</span> (d <span style="color: #d9c6d6;">-&gt;</span> b) <span style="color: #d9c6d6;">-&gt;</span> t)  <span style="color: #d9c6d6;">&#8773;</span>
  <span style="color: #d9c6d6;">&#8707;</span> d   <span style="color: #d9c6d6;">.</span>  (s <span style="color: #d9c6d6;">-&gt;</span> (d <span style="color: #d9c6d6;">-&gt;</span> a)) <span style="color: #d9c6d6;">&#215;</span> (s <span style="color: #d9c6d6;">&#215;</span> (d <span style="color: #d9c6d6;">-&gt;</span> b) <span style="color: #d9c6d6;">-&gt;</span> t)  <span style="color: #d9c6d6;">&#8773;</span>
  <span style="color: #d9c6d6;">&#8707;</span> d   <span style="color: #d9c6d6;">.</span>  (d <span style="color: #d9c6d6;">-&gt;</span> (s <span style="color: #d9c6d6;">-&gt;</span> a)) <span style="color: #d9c6d6;">&#215;</span> (s <span style="color: #d9c6d6;">&#215;</span> (d <span style="color: #d9c6d6;">-&gt;</span> b) <span style="color: #d9c6d6;">-&gt;</span> t)  <span style="color: #d9c6d6;">&#8773;</span>
  (s <span style="color: #d9c6d6;">&#215;</span> ((s <span style="color: #d9c6d6;">-&gt;</span> a) <span style="color: #d9c6d6;">-&gt;</span> b) <span style="color: #d9c6d6;">-&gt;</span> t)  <span style="color: #d9c6d6;">&#8773;</span>
  ((s <span style="color: #d9c6d6;">-&gt;</span> a) <span style="color: #d9c6d6;">-&gt;</span> b) <span style="color: #d9c6d6;">-&gt;</span> s <span style="color: #d9c6d6;">-&gt;</span> t
</pre>
</div>

<p>
My intuition at the moment is &ldquo;If from a getter you can create a b, then you can update s
to t&rdquo;, which apparently also rhymes.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr><p class="date">Last edited 2020-04-25 12:12:10 by Mario Román (<a href="https://github.com/mroman42/cosmoi">code</a>).</p>
</div>
</body>
</html>
